<?php

function getTeams(): array
{
    $teams = [
        [
            'name' => 'Ливерпуль',
        ],
        [
            'name' => 'Челси',
        ],
        [
            'name' => 'Тоттенхэм Хотспур',
        ],
        [
            'name' => 'Арсенал',
        ],
        [
            'name' => 'Манчестер Юнайтед',
        ],
        [
            'name' => 'Эвертон',
        ],
        [
            'name' => 'Лестер Сити',
        ],
        [
            'name' => 'Вест Хэм Юнайтед',
        ],
        [
            'name' => 'Уотфорд',
        ],
        [
            'name' => 'Борнмут',
        ],
        [
            'name' => 'Бернли',
        ],
        [
            'name' => 'Саутгемптон',
        ],
        [
            'name' => 'Брайтон энд Хоув Альбион',
        ],
        [
            'name' => 'Норвич Сити',
        ],
        [
            'name' => 'Шеффилд Юнайтед',
        ],
        [
            'name' => 'Фулхэм',
        ],
        [
            'name' => 'Сток Сити',
        ],
        [
            'name' => 'Мидлсбро',
        ],
        [
            'name' => 'Суонси Сити',
        ],
        [
            'name' => 'Дерби Каунти',
        ],
    ];

    shuffle($teams);

    return $teams;
}
